Catalogs/Города.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Города</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяВРознице</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяВПроизводстве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКЛАДР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/АдресныеОбъекты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>АдресныеОбъекты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РодительскийИдентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МуниципальныйРодительскийИдентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сокращение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКЛАДР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеАдресныеСведения</Name>
					<Comment>Служебный идентификатор комбинации кодов ОКАТО и т.п.</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Уровень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Comment>Глобальный уникальный идентификатор адресного объекта ФНС</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодСубъектаРФ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Города/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьСписокГородовИнтерактивно(ПараметрыОперации, АдресРезультата = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЛОЖЬ КАК Пометка,
	|	АдресныеОбъектыСубъекты.Наименование + "" "" + АдресныеОбъектыСубъекты.Сокращение КАК СубъектРФ,
	|	АдресныеОбъектыГорода.Идентификатор КАК УИ,
	|	АдресныеОбъектыГорода.КодКЛАДР КАК КодКЛАДР,
	|	АдресныеОбъектыГорода.Наименование КАК Город,
	|	ВЫБОР
	|		КОГДА АдресныеОбъектыРодитель.Идентификатор = АдресныеОбъектыСубъекты.Идентификатор
	|			ТОГДА АдресныеОбъектыГорода.Наименование + "" "" + АдресныеОбъектыГорода.Сокращение
	|		ИНАЧЕ АдресныеОбъектыГорода.Наименование + "" "" + АдресныеОбъектыГорода.Сокращение + "" ("" + АдресныеОбъектыРодитель.Наименование + "" "" + АдресныеОбъектыРодитель.Сокращение + "")""
	|	КОНЕЦ КАК ГородПредставление,
	|	4 КАК Уровень
	|ИЗ
	|	РегистрСведений.АдресныеОбъекты КАК АдресныеОбъектыГорода
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АдресныеОбъекты КАК АдресныеОбъектыСубъекты
	|		ПО (АдресныеОбъектыСубъекты.Уровень = 1)
	|			И (АдресныеОбъектыСубъекты.КодСубъектаРФ = АдресныеОбъектыГорода.КодСубъектаРФ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АдресныеОбъекты КАК АдресныеОбъектыРодитель
	|		ПО (АдресныеОбъектыРодитель.Идентификатор = АдресныеОбъектыГорода.РодительскийИдентификатор)
	|ГДЕ
	|	АдресныеОбъектыГорода.Уровень В (4, 6)
	|	И НЕ АдресныеОбъектыРодитель.Уровень В (4, 6)
	|
	|УПОРЯДОЧИТЬ ПО
	|	СубъектРФ,
	|	Город
	|ИТОГИ
	|	1 КАК Уровень
	|ПО
	|	СубъектРФ
	|АВТОУПОРЯДОЧИВАНИЕ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЛОЖЬ КАК Пометка,
	|	АдресныеОбъектыСубъекты.Наименование + "" "" + АдресныеОбъектыСубъекты.Сокращение КАК СубъектРФ,
	|	АдресныеОбъектыГорода.Идентификатор КАК УИ,
	|	АдресныеОбъектыГорода.РодительскийИдентификатор КАК УИРодителя,
	|	АдресныеОбъектыГорода.КодКЛАДР КАК КодКЛАДР,
	|	АдресныеОбъектыГорода.Наименование КАК Город,
	|	АдресныеОбъектыГорода.Наименование + "" "" + АдресныеОбъектыГорода.Сокращение КАК ГородПредставление,
	|	4 КАК Уровень
	|ИЗ
	|	РегистрСведений.АдресныеОбъекты КАК АдресныеОбъектыГорода
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АдресныеОбъекты КАК АдресныеОбъектыСубъекты
	|		ПО (АдресныеОбъектыСубъекты.Уровень = 1)
	|			И (АдресныеОбъектыСубъекты.КодСубъектаРФ = АдресныеОбъектыГорода.КодСубъектаРФ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АдресныеОбъекты КАК АдресныеОбъектыРодитель
	|		ПО (АдресныеОбъектыРодитель.Идентификатор = АдресныеОбъектыГорода.РодительскийИдентификатор)
	|ГДЕ
	|	АдресныеОбъектыГорода.Уровень В (4, 6)
	|	И АдресныеОбъектыРодитель.Уровень В (4, 6)
	|
	|УПОРЯДОЧИТЬ ПО
	|	СубъектРФ,
	|	Город
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	//ДеревоГородов = РезультатЗапроса.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	ДеревоГородов = РезультатЗапроса[0].Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	ГНППодчиненныеГНП = РезультатЗапроса[1].Выгрузить();
	
	СтрокиСубъектов = ДеревоГородов.Строки;
	Для каждого СтрокаСубъекта из СтрокиСубъектов Цикл
		СтрокиГНП = СтрокаСубъекта.Строки;
		Для каждого СтрокаГНП из СтрокиГНП Цикл
			СтруктураПоиска = Новый Структура("УИРодителя, СубъектРФ", СтрокаГНП.УИ, СтрокаГНП.СубъектРФ);
			НС = ГНППодчиненныеГНП.НайтиСтроки(СтруктураПоиска);
			Если НС.Количество() > 0 Тогда
				СтрокиПодчиненныхГНП = СтрокаГНП.Строки;
				для каждого СтрокаНс из НС Цикл
					НоваяСтрока =  СтрокиПодчиненныхГНП.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаНС);
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;		
	КонецЦикла;
	
	ПараметрыОбмена = Новый Структура("ДеревоГородов", ДеревоГородов);	
	ПоместитьВоВременноеХранилище(ПараметрыОбмена, АдресРезультата);	
	
КонецПроцедуры

Функция ДобавитьИзКлассификатора(МассивГородов, ИспользуетсяВРознице, ИспользуетсяВПроизводстве) Экспорт
	
	Добавлено = Ложь;
	
	Для каждого ЭлементГорода из МассивГородов Цикл
		НайденныйГород = Справочники.Города.НайтиПоНаименованию(ЭлементГорода.Город, Истина);
		Если НЕ ЗначениеЗаполнено(НайденныйГород) ТОгда
			СпрОбъект = Справочники.Города.СоздатьЭлемент();
			СпрОбъект.Наименование = ЭлементГорода.Город;
			СпрОбъект.КодКЛАДР = ЭлементГорода.КодКЛАДР;
			СпрОбъект.ИспользуетсяВРознице = ИспользуетсяВРознице;
			СпрОбъект.ИспользуетсяВПроизводстве = ИспользуетсяВПроизводстве;
			СпрОбъект.Записать();
			Добавлено = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Добавлено;

КонецФункции

#КонецОбласти

#КонецЕсли
